; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	spectrograph1 - mode
	thermograph4 - mode
	spectrograph0 - mode
	spectrograph2 - mode
	infrared3 - mode
	Star1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star8 - direction
	GroundStation9 - direction
	Star10 - direction
	Star11 - direction
	Star7 - direction
	Star6 - direction
	Star0 - direction
	GroundStation2 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 Star11)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared3)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument2 spectrograph1)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 Star6)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
)
(:goal (and
	(pointing satellite1 Star10)
	(have_image Planet12 thermograph4)
	(have_image Planet13 spectrograph1)
	(have_image Planet14 spectrograph1)
	(have_image Planet15 spectrograph2)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 5
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 5
3. (turn_to satellite0 planet13 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet13)
   goals met: 1 of 5
4. (turn_to satellite0 star0 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star0)
   goals met: 1 of 5
5. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 1 of 5
6. (turn_to satellite0 planet13 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet13)
   goals met: 1 of 5
7. (take_image satellite0 planet13 instrument1 spectrograph1)
   added: (have_image planet13 spectrograph1)
   goals met: 2 of 5
8. (turn_to satellite0 planet14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet14)
   goals met: 2 of 5
9. (take_image satellite0 planet14 instrument1 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 3 of 5
10. (turn_to satellite0 planet15 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet15)
   goals met: 3 of 5
11. (take_image satellite0 planet15 instrument1 spectrograph2)
   added: (have_image planet15 spectrograph2)
   goals met: 4 of 5
12. (turn_to satellite1 star6 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star6)
   goals met: 3 of 5
13. (calibrate satellite1 instrument2 star6)
   added: (calibrated instrument2)
   goals met: 3 of 5
14. (turn_to satellite1 planet12 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet12)
   goals met: 3 of 5
15. (take_image satellite1 planet12 instrument2 thermograph4)
   added: (have_image planet12 thermograph4)
   goals met: 4 of 5
16. (turn_to satellite1 star10 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star10)
   goals met: 5 of 5
